"""
Task 2.3
"""
year_list = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима",]
year_dic = {1: "Зима",
            2: "Зима",
            3: "Весна",
            4: "Весна",
            5: "Весна",
            6: "Лето",
            7: "Лето",
            8: "Лето",
            9: "Осень",
            10: "Осень",
            11: "Осень",
            12: "Зима",}
month = int(input("Введите номер месяца: "))
print(f"Ваше время года: {year_dic.get(month)}. Это вариант через dict")
print(f"Ваше время года: {year_list[month-1]}. Это вариант через list")
